# 知识点：变量、数据类型、运算符、输入输出
# 作业提交：名字 - 2510期1班周作业1
# 提交格式：复制代码，粘贴到邮箱正文中
# 提交邮箱：wenxin3366@qq.com

# 一、选择题
# 1.以下变量命名规范且正确的是（）
# A，False    B,1a        C,student_score        D,.*?

# 2.以下说法错误的是( )
# A,变量需要先定义再使用
# B,变量由于是自己定义的所以想怎么定义就怎么定义
# C,变量可以用来存储数据
# D,变量是动态绑定的名称，本质是对对象的引用

# 3.下面的代码运行结果为( )
# a = 1
# b = 2
# a = 3
# b = 4
# print(a+b)
# A,3     B,5     C,7      D,10

# 4.float(5)转换后的结果是（）
# A. 5
# B. "5"
# C. 5.0
# D. '5'

# 5.下列表达式的运算结果是(  ) 。
# a = 100
# b = False
# print(a * b > -1)

# A. False
# B. 1
# C. 0
# D.True

# 6.下面的代码运行结果为( )
# a = input('请输入你的数字：')  # 5
# b = input('请输入你的数字：')  # 3
# print(a+b)
# A,8     B,53     C,8.0      D,报错

# 7.以下优先级正确的是： ( )
# A. 算术运算符 > 比较运算符 > 逻辑运算符
# B. 算术运算符 > 逻辑运算符 > 比较运算符
# C. 比较运算符 > 逻辑运算符 > 算术运算符
# D. 逻辑运算符 > 算术运算符 > 比较运算符

# 8.逻辑运算符的优先级是：( )
# A. and > not > or
# B. or > not > and
# C. not > and > or
# D. and > or > not

# 二、代码题
# 1.使用input函数输入语数英三门课程成绩，并计算总分和平均分，并输出结果。
# 提示：输入的数据存储到变量中，并注意数据的转换


# 2.【小明】在购物中心买了一件毛衣，毛衣原价为【175】元，因为反季促销，毛衣打【七五】折，打折后的毛衣价格为【？】元
# 1)对应【】中的数据使用变量存储
# 2)将打折后的毛衣价格计算出来，输出结果保留一位小数
# 提示：注意变量名的组成，以及见名知意，不能使用拼音及中文作为变量名


# 3.根据下面的表达式，写出推理过程，判断最后的结果是True还是False
# 提示：非零非空极为真为True
# not (1 == 2 or 8 / 3 ==2 ) and (2*2**3 == 64)
# (1+2==2 or 3*3) and True


# 4.输入两个数和一个符号，完成两个数的计算
# 例如：
#     请输入第一个数字：5
#     请输入第二个数字：3
#     请输入要执行的运算符：+
#     结果：8
# 提示：定义三个变量，使用input函数输入数据，并注意数据转换(不使用if判断)



# 5.简答题
# 1) 12.5   是什么类型的数据？
# 2) '12.5'  是什么类型的数据？
# 3) 12 + 5.5   计算是否会报错？如果不报错，结果是多少？
# 4) 12.5 + '5.5'  计算是否会报错？如果不报错，结果是多少？
# 5) '4.0' + 'a'   计算是否会报错？如果不报错，结果是多少？




# 全选：ctrl+a
# 复制：ctrl+c
# 粘贴：ctrl+v